In [1]:
import numpy as np 
import pandas as pd 
from sklearn.preprocessing import StandardScaler

In [4]:

data = pd.read_csv('test.csv')

In [5]:
pclass = data['Pclass']

In [6]:
df =pd.get_dummies(pclass,drop_first= True)

In [7]:
class_2 = df.iloc[:,0]
class_3 = df.iloc[:,1]

In [8]:
new_df = pd.concat([data,class_2,class_3],axis = 1)

In [9]:
new_df = new_df.drop('Name',axis = 1)

In [10]:
new_df['Sex_New'] = new_df['Sex'].map({'male':0,'female':1})

In [11]:
new_df.head()

,PassengerId,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,2,3,Sex_New
0,892,3,male,34.5,0,0,330911,7.8292,NaN,Q,0,1,0
1,893,3,female,47.0,1,0,363272,7.0000,NaN,S,0,1,1
2,894,2,male,62.0,0,0,240276,9.6875,NaN,Q,1,0,0
3,895,3,male,27.0,0,0,315154,8.6625,NaN,S,0,1,0
4,896,3,female,22.0,1,1,3101298,12.2875,NaN,S,0,1,1

In [12]:
new_df= new_df.drop(['Sex'],axis  = 1)

In [13]:
embarked = new_df['Embarked']

In [14]:
embarked_dummy = pd.get_dummies(embarked,drop_first=True)
new_df = pd.concat([new_df,embarked_dummy],axis = 1)
new_df.head()

,PassengerId,Pclass,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,2,3,Sex_New,Q,S
0,892,3,34.5,0,0,330911,7.8292,NaN,Q,0,1,0,1,0
1,893,3,47.0,1,0,363272,7.0000,NaN,S,0,1,1,0,1
2,894,2,62.0,0,0,240276,9.6875,NaN,Q,1,0,0,1,0
3,895,3,27.0,0,0,315154,8.6625,NaN,S,0,1,0,0,1
4,896,3,22.0,1,1,3101298,12.2875,NaN,S,0,1,1,0,1

In [15]:
new_df = new_df.drop('Embarked',axis = 1)

In [16]:
new_df = new_df.drop('Cabin',axis = 1)

In [18]:
new_df = new_df.drop('PassengerId',axis = 1)
new_df.head()

   Pclass   Age  SibSp  Parch   Ticket     Fare  2  3  Sex_New  Q  S
0       3  34.5      0      0   330911   7.8292  0  1        0  1  0
1       3  47.0      1      0   363272   7.0000  0  1        1  0  1
2       2  62.0      0      0   240276   9.6875  1  0        0  1  0
3       3  27.0      0      0   315154   8.6625  0  1        0  0  1
4       3  22.0      1      1  3101298  12.2875  0  1        1  0  1

In [19]:
new_df = new_df.drop('Pclass',axis = 1)

In [20]:
new_df.head()

    Age  SibSp  Parch   Ticket     Fare  2  3  Sex_New  Q  S
0  34.5      0      0   330911   7.8292  0  1        0  1  0
1  47.0      1      0   363272   7.0000  0  1        1  0  1
2  62.0      0      0   240276   9.6875  1  0        0  1  0
3  27.0      0      0   315154   8.6625  0  1        0  0  1
4  22.0      1      1  3101298  12.2875  0  1        1  0  1

In [22]:
df_standardisation1 = new_df.iloc[:,0]
df_standardisation2 = new_df.iloc[:,4]
new_df_combined = pd.concat([df_standardisation1,df_standardisation2],axis = 1)

In [23]:
scaler = StandardScaler()

In [24]:

scaler.fit(new_df_combined)

StandardScaler()

In [25]:
stnd_df = scaler.transform(new_df_combined)

In [26]:
data_age_fare = pd.DataFrame({'Age_new':stnd_df[:,0],'Fare_new':stnd_df[:,1]})

In [28]:
new_df= pd.concat([new_df,data_age_fare],axis = 1)
final = new_df.copy()

In [29]:
final['Age_new'] = final['Age_new'].fillna(final['Age_new'].mean())
final['Fare_new'] = final['Fare_new'].fillna(final['Fare_new'].mean())

In [30]:
final.head()

,Age,SibSp,Parch,Ticket,Fare,2,3,Sex_New,Q,S,Age_new,Fare_new,Age_new,Fare_new
0,34.5,0,0,330911,7.8292,0,1,0,1,0,0.298549,-0.497811,0.298549,-0.497811
1,47.0,1,0,363272,7.0000,0,1,1,0,1,1.181328,-0.512660,1.181328,-0.512660
2,62.0,0,0,240276,9.6875,1,0,0,1,0,2.240662,-0.464532,2.240662,-0.464532
3,27.0,0,0,315154,8.6625,0,1,0,0,1,-0.231118,-0.482888,-0.231118,-0.482888
4,22.0,1,1,3101298,12.2875,0,1,1,0,1,-0.584229,-0.417971,-0.584229,-0.417971

In [33]:
# final = final.drop(['Age','Fare'],axis = 1)
final = final.drop(['Age_new','Fare_new'],axis = 1)

In [34]:
final.head()

   SibSp  Parch   Ticket  2  3  Sex_New  Q  S
0      0      0   330911  0  1        0  1  0
1      1      0   363272  0  1        1  0  1
2      0      0   240276  1  0        0  1  0
3      0      0   315154  0  1        0  0  1
4      1      1  3101298  0  1        1  0  1

In [35]:
final = final.drop('Ticket',axis = 1)

In [38]:
final = pd.concat([final,data_age_fare],axis = 1)
final

     SibSp  Parch  2  3  Sex_New  Q  S   Age_new  Fare_new   Age_new  Fare_new
0        0      0  0  1        0  1  0  0.298549 -0.497811  0.298549 -0.497811
1        1      0  0  1        1  0  1  1.181328 -0.512660  1.181328 -0.512660
2        0      0  1  0        0  1  0  2.240662 -0.464532  2.240662 -0.464532
3        0      0  0  1        0  0  1 -0.231118 -0.482888 -0.231118 -0.482888
4        1      1  0  1        1  0  1 -0.584229 -0.417971 -0.584229 -0.417971
..     ...    ... .. ..      ... .. ..       ...       ...       ...       ...
413      0      0  0  1        0  0  1       NaN -0.493856       NaN -0.493856
414      0      0  0  0        1  0  0  0.616350  1.312180  0.616350  1.312180
415      0      0  0  1        0  0  1  0.581038 -0.508183  0.581038 -0.508183
416      0      0  0  1        0  0  1       NaN -0.493856       NaN -0.493856
417      1      1  0  1        0  0  0       NaN -0.237621       NaN -0.237621

[418 rows x 11 columns]

In [37]:
final.columns.values

array(['SibSp', 'Parch', 2, 3, 'Sex_New', 'Q', 'S', 'Age_new', 'Fare_new'],
      dtype=object)

In [39]:
final['Age_new'] = final['Age_new'].fillna(final['Age_new'].mean())
final['Fare_new'] = final['Fare_new'].fillna(final['Fare_new'].mean())

     SibSp  Parch  2  3  Sex_New  Q  S   Age_new  Fare_new   Age_new  Fare_new
0        0      0  0  1        0  1  0  0.298549 -0.497811  0.298549 -0.497811
1        1      0  0  1        1  0  1  1.181328 -0.512660  1.181328 -0.512660
2        0      0  1  0        0  1  0  2.240662 -0.464532  2.240662 -0.464532
3        0      0  0  1        0  0  1 -0.231118 -0.482888 -0.231118 -0.482888
4        1      1  0  1        1  0  1 -0.584229 -0.417971 -0.584229 -0.417971
..     ...    ... .. ..      ... .. ..       ...       ...       ...       ...
413      0      0  0  1        0  0  1       NaN -0.493856       NaN -0.493856
414      0      0  0  0        1  0  0  0.616350  1.312180  0.616350  1.312180
415      0      0  0  1        0  0  1  0.581038 -0.508183  0.581038 -0.508183
416      0      0  0  1        0  0  1       NaN -0.493856       NaN -0.493856
417      1      1  0  1        0  0  0       NaN -0.237621       NaN -0.237621

[418 rows x 11 columns]

In [41]:
data_age_fare

      Age_new  Fare_new
0    0.298549 -0.497811
1    1.181328 -0.512660
2    2.240662 -0.464532
3   -0.231118 -0.482888
4   -0.584229 -0.417971
..        ...       ...
413       NaN -0.493856
414  0.616350  1.312180
415  0.581038 -0.508183
416       NaN -0.493856
417       NaN -0.237621

[418 rows x 2 columns]

In [42]:
data_age_fare['Age_new'] = data_age_fare['Age_new'].fillna(data_age_fare['Age_new'].mean())
data_age_fare['Fare_new'] = data_age_fare['Fare_new'].fillna(data_age_fare['Fare_new'].mean())

In [43]:
data_age_fare

          Age_new  Fare_new
0    2.985493e-01 -0.497811
1    1.181328e+00 -0.512660
2    2.240662e+00 -0.464532
3   -2.311178e-01 -0.482888
4   -5.842293e-01 -0.417971
..            ...       ...
413  4.280378e-17 -0.493856
414  6.163496e-01  1.312180
415  5.810385e-01 -0.508183
416  4.280378e-17 -0.493856
417  4.280378e-17 -0.237621

[418 rows x 2 columns]

In [46]:
new = new_df.drop(['Age','Ticket','Fare','Age_new','Fare_new'],axis = 1)
new.head()

   SibSp  Parch  2  3  Sex_New  Q  S
0      0      0  0  1        0  1  0
1      1      0  0  1        1  0  1
2      0      0  1  0        0  1  0
3      0      0  0  1        0  0  1
4      1      1  0  1        1  0  1

In [47]:
fff = pd.concat([new,data_age_fare],axis = 1)
fff.head()

   SibSp  Parch  2  3  Sex_New  Q  S   Age_new  Fare_new
0      0      0  0  1        0  1  0  0.298549 -0.497811
1      1      0  0  1        1  0  1  1.181328 -0.512660
2      0      0  1  0        0  1  0  2.240662 -0.464532
3      0      0  0  1        0  0  1 -0.231118 -0.482888
4      1      1  0  1        1  0  1 -0.584229 -0.417971

In [48]:
fff.columns.values

array(['SibSp', 'Parch', 2, 3, 'Sex_New', 'Q', 'S', 'Age_new', 'Fare_new'],
      dtype=object)

In [49]:
t =[2, 3,'SibSp', 'Parch','Sex_New', 'Q', 'S', 'Age_new', 'Fare_new']
fff= fff[t]

In [50]:
fff.head()

   2  3  SibSp  Parch  Sex_New  Q  S   Age_new  Fare_new
0  0  1      0      0        0  1  0  0.298549 -0.497811
1  0  1      1      0        1  0  1  1.181328 -0.512660
2  1  0      0      0        0  1  0  2.240662 -0.464532
3  0  1      0      0        0  0  1 -0.231118 -0.482888
4  0  1      1      1        1  0  1 -0.584229 -0.417971

In [ ]:
fff.to_csv('test_modifies.csv',index = False)